package dev.kalenchukov.stringrand.resources;

/**
 * Наборы символов.
 */
public enum SymbolKit
{
	/**
	 * Набор двоичной системы счисления.
	 */
	BINARY(new char[]{
		'0', '1'
	}),

	/**
	 * Набор восьмеричной системы счисления.
	 */
	OCTAL(new char[]{
		'0', '1', '2', '3', '4', '5', '6', '7'
	}),

	/**
	 * Набор десятеричной системы счисления.
	 */
	DECIMAL(new char[]{
		'0', '1', '2', '3', '4', '5', '6', '7', '8', '9'
	}),

	/**
	 * Набор двенадцатеричной системы счисления.
	 */
	DUODECIMAL(new char[]{
		'0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'A', 'B'
	}),

	/**
	 * Набор шестнадцатеричной системы счисления.
	 */
	HEX(new char[]{
		'0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'A', 'B', 'C', 'D', 'E', 'F'
	}),

	/**
	 * Набор прописных букв латинского алфавита.
	 */
	LOWER(new char[]{
		'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm',
		'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z'
	}),

	/**
	 * Набор строчных букв латинского алфавита.
	 */
	UPPER(new char[]{
		'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M',
		'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z'
	}),

	/**
	 * Набор символов печатаемых с клавиатуры
	 */
	GRAPH(new char[]{
		'!', '"', '#', '$', '%', '&', '\'', '(', ')', '*', '+', ',', '-', '.', '/', ':',
		';', '<', '=', '>', '?', '@', '[', '\\', ']', '^', '_', '`', '{', '|', '}', '~'
	});

	/**
	 * Набор символов.
	 */
	private final char[] kit;

	/**
	 * Конструктор для {@code SymbolKit}.
	 *
	 * @param kit Набор символов.
	 */
	SymbolKit(final char[] kit)
	{
		this.kit = kit;
	}

	/**
	 * Возвращает набор символов.
	 *
	 * @return Массив символов.
	 */
	public char[] getSymbols()
	{
		return this.kit;
	}
}
